src/test/resources/reusable_content/soap_sample_request_body.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.ebookstore.odvali.ge/">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getName>
            <!--Optional:-->
            <name>hello</name>
        </soap:getName>
    </soapenv:Body>
</soapenv:Envelope>